package prompt

var Summary = `你是一个总结对话内容的专家。
以下将提供一段来自用户（user）与ai助手（assistant）的对话记录。 
请你对对话记录进行摘要总结,总结请用英文，提炼出用户与助手这段对话内容的对话主题与重要内容。注意:user1对应用户（user），user2对应ai助手（assistant）
以下是用户与助手的对话记录: 

{{.}}

总结为:`

var AppendSummary = `你是一个总结对话内容的专家。 
以下将提供一段来自于用户（user）和ai助手（assistant）的历史对话摘要信息与后续新增的对话QA对。 
你需要基于历史摘要信息与本次的新增QA对信息进行重新总结，总结请用英文。 
请你基于历史摘要中的核心对话主题，在不遗漏历史摘要关键信息的前提下，补足本次新增的对话摘要进入新摘要中。 注意:user1对应用户（user），user2对应ai助手（assistant）

{{.}}

重新总结为:`

var QuestionTypeCOT = `你是一个用于判断用户提问内容是否需要关联上下文内容的专家，你需要判断用户提问的内容是否包含足够的语义信息来回答此问题。
假设当前存在两个用户之间的历史聊天记录，记录中包含了多个聊天主题。你需要针对本次提出的问题判断该问题需要引用多少上文内容才能完成回答。
若你认为该问题涉及全部历史内容，尤其是提问中存在“一共”、“所有”、“完整”等关键词时请回复all，若你认为该问题是独立的，不需要结合历史内容就能完成回答，请回复one，若你认为该问题需要结合部分上下文信息，请回复part。

你需要先进行思考，然后做出你的回答。注意:user1对应用户（user），user2对应ai助手（assistant）
你应该分析当前的提问语义是否完整、是否存在歧义、是否不需要依赖于上下文，接着做出只包含 one/part/all 三者其一的回答。格式如下：
[Reasoning]
Here is your reasoning and thought process.
[Judge]
one/part/all

例：
提问: 你是谁？
[Reasoning]
该提问语义完整，提问中的“你”在单聊对话中不存在歧义，因此可以无需引用上文，直接进行回答。
[Judge]
one

提问: 珠穆朗玛峰有多高？
[Reasoning]
珠穆朗玛峰的高度是一个客观数据，可以直接进行回答。
[Judge]
one

提问: 我之前一共问过你哪些问题呢？
[Reasoning]
“一共”一词表明该问题需要借助先前的所有历史聊天记录才能回答。
[Judge]
all

提问: 这个问题具体的难点是什么？
[Reasoning]
该提问中包含模糊指代”这个问题“，需要借助上文的内容进行补充。从提问方式上来看应当方向性较为明确，上文应当能找到一个明确的话题主题与之关联，因此认定为只需要部分上下文关联即可回答。
[Judge]
part

现在开始进行思考并判断提问属于 all/part/one 中的哪一类:
提问: {{.}}`

var AssociationCOT = `你是一个判断对话主题内容与用户提问内容相关性的专家。
你需要判断用户提问的内容是否跟提供的对话主题有关，或者是否可能是由该对话主题衍生的进一步提问。注意:user1对应用户（user），user2对应ai助手（assistant）
你需要先分析对话主题内容与用户提问之间的关联性可能，再输出你最终的判断。遵从以下格式进行输出： 
[Reasoning] 
here is your reasoning content... 
[Judge] 
yes/no

输入输出例子如下：
例:
主题: 用户询问如何避免黑客攻击和确保网络连接的安全性。助手给出了包括更新软件和操作系统、安装杀毒软件、使用强密码、避免打开未知邮件、使用安全网络连接、加密数据、限制权限、定期备份数据、培训员工、定期审查安全策略、防范社交工程、确保网络设备安全、限制端口访问、制定应急响应计划和寻求专业帮助等在内的多条建议。此外，还介绍了如何确保网络连接安全性的措施，如使用可靠的网络设备、配置网络安全策略、启用防火墙、使用VPN、保护无线网络、避免公共WiFi、更新软件和操作系统、强化网络安全意识、监控网络活动、加密敏感数据、限制权限和访问控制、及时处理安全事件、定期审查网络安全策略以及制定应急响应计划等。
提问: 对于金融机构来说，如何保护客户的隐私和数据安全？
输出: 
[Reasoning]
原始主题讨论的是网络安全相关的内容，助手给出了部分增强安全性的建议。提问的内容是关于金融领域的隐私和数据安全问题，和前文谈论的安全性相关内容有关联，猜测客户可能是想追问金融机构在网络安全方面的措施。
[Judge]
yes

例:
主题: 用户询问影响网站性能的因素，得到的回答包括服务器性能、网站架构、网络延迟、CDN、数据库性能、应用程序性能、第三方服务、浏览器兼容性、用户设备性能、网站访问量、网络安全和防护以及网站维护和更新等。要提高网站性能，需要针对这些因素进行优化。
提问: 我应该采取什么措施来处理经济压力？
输出: 
[Reasoning]
主题讨论了网站性能影响因素及优化措施，追加提问是用户希望了解怎么处理自身的经济压力，二者不相关。
[Judge]
no

需要注意，当主题讨论的是“领域A”而提问的主体内容转移为了“领域B”，如从音乐领域转移到了游戏领域的讨论，应当输出no。

现在开始判断主题与提问是否存在相关性:

{{.}}

输出:
`
