ABTEST_PROMPT = '''
# Role
你是一个裁判，你需要在给定的若干个示例当中选出你认为最贴近参考答案的一个候选答案。

# Rule
1. 下文中会给定一个用户提出的问题，一个参考答案以及 n 个候选答案，你需要在 n 个候选答案中选出你认为最贴近参考答案的唯一的候选答案编号；
2. 你仅需要输出候选答案的编号，无需输出其他的内容；
3. 你的评价指标只需要给予给定的参考答案，无需借助其他的知识内容。

# Example
## 问题内容
小明和小红在上文中的对话内容是什么？

## 参考答案
小明和小红约定暑假去杭州玩，现在在讨论要乘坐什么交通工具去目的地。

## 候选答案
[A] 小明和小红约定去杭州玩，时间定在暑假，但出行的交通工具还没讨论出结果。

[B] 小红和小明在这个暑假要一起去玩，但是还没决定好乘坐什么交通工具去目的地。

[C] 小明和小红约定去上海玩，现在在讨论游玩预算定在多少比较合适。

## 你认为的最优候选答案
[A]

# Start your judge
## 问题内容
{question}

## 参考答案
{expected_answer}
 
## 候选答案
[A] {a}

[B] {b}

## 你认为的最优候选答案
'''


ABTEST_PROMPT_V2 = '''
# Role
你是一个裁判，你需要在给定的若干个示例当中选出你认为最贴近参考答案的一个候选答案。

# Rule
1. 下文中会给定一个用户提出的问题，一个参考答案以及 n 个候选答案，你需要在 n 个候选答案中选出你认为最贴近参考答案的唯一的候选答案编号；
2. 你需要先阐述你对给定候选答案的优缺点分析，再给出你最终的评价标准。按照以下格式进行生成：
[Reasoning]
here is your judge reason...
[Judge]
here is your answer [question_id]
3. 如果你觉得给定的候选答案无法拉开明显差距，请输出 [TIE]

# Example
## 问题内容
小明和小红在上文中的对话内容是什么？

## 参考答案
小明和小红约定暑假去杭州玩，现在在讨论要乘坐什么交通工具去目的地。

## 候选答案
[A] 小明和小红约定去杭州玩，时间定在暑假，但出行的交通工具还没讨论出结果。

[B] 小红和小明在这个暑假要一起去玩，但是还没决定好乘坐什么交通工具去目的地。

[C] 小明和小红约定去上海玩，现在在讨论游玩预算定在多少比较合适。

## 开始你的分析和判断
[Reasoning]
问题是关于上文对话内容的回忆，参考答案涉及到以下核心点：
1. 小明和小红约定暑假去杭州玩
2. 现在处于讨论交通方式的阶段
候选答案[A]覆盖完全以上内容，[B]忽略了“杭州”的关键地点信息，[C]答案指向其他的地区，因此相比之下答案[A]最完善。
[Judge]
[A]

# Start your judge
## 问题内容
{question}

## 参考答案
{expected_answer}
 
## 候选答案
[A] {a}

[B] {b}

## 开始你的分析和判断
'''



SCORE_PROMPT_DS='''
# Role
你是一个打分裁判，你会获得一个问题、该问题的参考答案以及一个候选答案，你需要比较候选答案与参考答案的相似度，然后给出你对参考答案的评分。

# Rule
1. 下文中会给定一个用户提出的问题，一个参考答案以及一个候选答案，你需要给出候选答案与参考答案的语义相似度评分；
2. 你需要给出候选答案的相似度评分，无需输出其他的内容，格式如下：
[Score]
here is your score
3. 你的评价指标只需要给予给定的参考答案，无需借助其他的知识内容；
4. 评分范围为 0～10 分，其中 0 分代表候选答案与参考答案完全不一致，10 分代表候选答案与参考答案语义上完全一致；
5. 分数保留整数，无需呈现小数位；
6. 如果候选答案是 “对不起，您的问题我暂时理解不了” ，请直接给予 0 分；
7. 若候选答案中有内容符合参考答案中的内容时进行分数提升。需要注意，对于候选答案中的冗余内容（即在参考答案中无法找到相对应的内容，或是无关内容的补充），不对其进行加分；

# Example
## 问题内容
小明和小红在上文中的对话内容是什么？

## 参考答案
小明和小红约定暑假去杭州玩，现在在讨论要乘坐什么交通工具去目的地。

## 候选答案
小红和小明在这个暑假要一起去玩，现在正在讨论乘坐什么交通工具去目的地。

## 评分
[Score]
8

# Start your judge
## 问题内容
{question}

## 参考答案
{expected_answer}
 
## 候选答案
{candidate_answer}

## 评分
'''

SCORE_PROMPT_COT='''
# Role
你是一个打分裁判，你会获得一个问题、该问题的参考答案以及一个候选答案，你需要比较候选答案与参考答案的相似度，然后给出你对参考答案的评分。

# Rule
1. 下文中会给定一个用户提出的问题，一个参考答案以及一个候选答案，你需要给出候选答案与参考答案的语义相似度评分；
2. 你需要先输出你的解读，最后给出候选答案的相似度评分，无需输出其他的内容，格式如下：
[Interpretation]
here is your interpretation...
[Score]
here is your score
3. 你的评价指标只需要给予给定的参考答案，无需借助其他的知识内容；
4. 评分范围为 0～10 分，其中 0 分代表候选答案与参考答案完全不一致，10 分代表候选答案与参考答案语义上完全一致；
5. 分数保留整数，无需呈现小数位；
6. 如果候选答案是 “对不起，您的问题我暂时理解不了” ，请直接给予 0 分；
7. 若候选答案中有内容符合参考答案中的内容时进行分数提升。需要注意，对于候选答案中的冗余内容（即在参考答案中无法找到相对应的内容，或是无关内容的补充），不对其进行加分；

# Example
## 问题内容
小明和小红在上文中的对话内容是什么？

## 参考答案
小明和小红约定暑假去杭州玩，现在在讨论要乘坐什么交通工具去目的地。

## 候选答案
小红和小明在这个暑假要一起去玩，现在正在讨论乘坐什么交通工具去目的地。

## 解读及评分
[Interpretation]
候选答案大体上与参考答案一致，但是未提及游玩的目的地——杭州，候选答案与参考答案相比缺失了目的地的关键信息，因此扣除2分。
[Score]
8

# Start your judge
## 问题内容
{question}

## 参考答案
{expected_answer}
 
## 候选答案
{candidate_answer}

## 解读及评分
'''


SCORE_PROMPT_BPS='''
# Role
你是一个打分裁判，你会获得一个问题、该问题的参考答案以及一个候选答案，你需要比较候选答案与参考答案的相似度，然后给出你对参考答案的评分。

# Rule
1. 下文中会给定一个用户提出的问题，一个参考答案以及一个候选答案，你需要给出候选答案与参考答案的语义相似度评分；
2. 你需要先输出你的解读，最后给出候选答案的相似度评分，无需输出其他的内容，格式如下：
[Interpretation]
here is your interpretation...
[Score]
here is your score
3. 你的评价指标只需要给予给定的参考答案，无需借助其他的知识内容；
4. 评分范围为 0～10 分，其中 0 分代表候选答案与参考答案完全不一致，10 分代表候选答案与参考答案语义上完全一致；
5. 分数保留整数，无需呈现小数位；
6. 如果候选答案是 “对不起，您的问题我暂时理解不了” ，请直接给予 0 分；
7. 你需要先对参考答案进行分析，列举出参考答案中可以得分的关键点，然后比对候选答案，按答对的关键点的占比来向上取整进行给分。例如参考答案可以总结为3个关键点，候选答案命中了其中2个关键点，可得分为：向上取整(2/3 * 10)= 7 分；

# Example
## 问题内容
小明和小红在上文中的对话内容是什么？

## 参考答案
小明和小红约定暑假去杭州玩，现在在讨论要乘坐什么交通工具去目的地。

## 候选答案
小红和小明在这个暑假要一起去玩，现在正在讨论乘坐什么交通工具去目的地。

## 解读及评分
[Interpretation]
参考答案中的关键得分点有：
1. 小明和小红在什么时候约好出去玩 —— 暑假
2. 他们两个约定去哪里玩 —— 杭州
2. 他们当前的行为状态 —— 在讨论使用什么交通工具去杭州
候选答案大体上与参考答案一致，可以匹配1、3得分点，但是未提及游玩的目的地——杭州，因此最终得分为 向上取整(2/3 * 10) = 7 分。
[Score]
7

# Start your judge
## 问题内容
{question}

## 参考答案
{expected_answer}
 
## 候选答案
{candidate_answer}

## 解读及评分
'''